{
    "habilidades": "As habilidades de Kauan incluem: Django, Python, DRF, SQL, APIs RESTful, e muito mais.",
    "projetos": [
        {
            "nome": "Sistema de Gestão de Estoque (SGE)",
            "descricao": "O SGE é uma plataforma para gerenciar estoques de maneira eficiente, controlando produtos, fornecedores e movimentações de entradas e saídas. Utiliza inteligência artificial para sugerir reposição de estoque e otimizar a gestão, além de gerar gráficos e métricas sobre vendas e produtos.",
            "tecnologias": ["Django", "Python", "PostgreSQL", "Celery", "Redis", "Docker", "IA", "Bootstrap", "Chart.js"],
            "Integracoes": ["Evolution API (WhatsApp)", "Gemini (IA)"]

        },
        {
            "nome": "ChatBot com IA - Projeto Python e IA",
            "descricao": "O ChatBot com IA é um projeto que utiliza inteligência artificial para criar um assistente virtual que responde perguntas e interage com os usuários. Com integração com APIs de IA, o ChatBot é capaz de aprender e melhorar suas respostas ao longo do tempo.",
            "tecnologias": ["Python", "LangChain", "Streamlit", "APIs de IA"],
            "Integracoes": ["APIs de IA (OpenAI)"]
        },
        {
            "nome": "Flix APP - Web App de Catálogo de Filmes",
            "descricao": "O Flix APP é um web app para visualizar e buscar filmes em um catálogo online. Com funcionalidades de busca, filtros, favoritos e avaliações, o Flix APP permite aos usuários encontrar e recomendar filmes de forma rápida e prática.",
            "tecnologias": ["Python", "Streamlit"],
            "Integracoes": ["Flix API (API de Catálogo de Filmes)"]
        },
        {
            "nome": "Flix API - API para Catálogo de Filmes",
            "descricao": "O Flix API é uma API para gerenciar um catálogo de filmes, com funcionalidades de CRUD, busca, filtros e autenticação de usuários. Com documentação interativa, facilita o desenvolvimento de aplicações front-end e integrações com outras plataformas.",
            "tecnologias": ["Django", "Python", "DRF", "PostgreSQL", "Docker", "Swagger"],
            "Integracoes": ["Não tem integrações com APIs externas"]
        },
        {
            "nome": "Teacherhunt - API de Busca de Professores Particulares",
            "descricao": "O Teacherhunt é uma API para conectar alunos e professores particulares de forma rápida e prática. Com filtros de busca, avaliações e chat integrado, facilita a contratação de aulas particulares. Funcionalidades como: Cadastro e gerenciamento de professores e alunos, Busca de professores por matéria de interesse, Agendamento, aceitação e cancelamento de aulas, Avaliações e favoritos para professores, Redefinição de senha e ativação de conta por email, Autentificação e recuperação de contas com JWT, Documentação interativa com Swagger",
            "tecnologias": ["Django", "Python", "DRF", "PostgreSQL", "Docker", "Swagger"],
            "Integracoes": ["Não tem integrações com APIs externas"]
        },
        {
            "nome": "Alura Space - Projeto Django FullStack",
            "descricao": "Alura Space é uma aplicação Django desenvolvida durante a formação da Alura sobre python e Djnago, essa aplicação permite: gerenciar e compartilhar imagens. É uma galeria de imagens que permite aos usuários fazer upload, editar, buscar, favoritar e curtir imagens. Além disso, os usuários podem gerenciar seus perfis, visualizar suas imagens e interagir com o conteúdo através de likes e favoritos. Funcionalidades como: Cadastro e autenticação de usuários, Gestão de imagens: upload, edição, busca, favoritos, curtidas, Busca e filtros de imagens por categoria, nome e autor, Perfis de usuários com informações e imagens favoritas",
            "tecnologias": ["Django", "Python", "PostgreSQL", "HTML", "CSS", "JavaScript"],
            "Integracoes": ["Não tem integrações com APIs externas"]
        }
    ],
    "contato": [
        "No portfolio de Kauan, na barra lateral (sidebar), você pode encontrar links para suas redes sociais e contatos. E na página de contato, você pode encontrar um formulário para enviar uma mensagem diretamente para Kauan.",
        "Você pode entrar em contato com Kauan pelos seguintes meios:",
        "E-mail: kauanrl09@gmail.com",
        "LinkedIn: https://www.linkedin.com/in/kauan-rodrigues-lima-727486321/",
        "GitHub: https://github.com/Kauanrodrigues01",
        "Instagram: https://www.instagram.com/kauan_mrl/"

    ],
    "certificados": [
        {
            "nome": "Django Master - Aplicações Web",
            "instituicao": "Pycodebr",
            "data": "2025",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "45 horas"
        },
        {
            "nome": "IA Master - Integração com IA, RAG, LangChain, Agents de IA",
            "instituicao": "Pycodebr",
            "data": "2025",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "20 horas"
        },
        {
            "nome": "Integration Master - Integração de Sistemas",
            "instituicao": "Pycodebr",
            "data": "2025",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "10 horas"
        },
        {
            "nome": "AWS Cloud Foundations",
            "instituicao": "AWS academy",
            "data": "2025",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "15 horas"
        },
        {
            "nome": "Google AI Essentials",
            "instituicao": "Google",
            "data": "2025",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "8 horas"
        },
        {
            "nome": "Docker: do Básico ao Avançado",
            "instituicao": "Udemy",
            "data": "2025",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "13 horas"
        },
        {
            "nome": "Django Web Framework e Django Rest Framework (DRF)",
            "instituicao": "Udemy",
            "data": "2024",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "79 horas"
        },
        {
            "nome": "Python 3 do Básico ao Avançado",
            "instituicao": "Udemy",
            "data": "2024",
            "link": "https://www.udemy.com/certificate/UC-4b3b3b3b-4b3b-4b3b-4b3b-4b3b3b3b3b3b/",
            "carga_horaria": "141 horas"
        }
    ],
    "educacao": "Kauan cursa Desenvolvimento de Sistemas na EEEP e estuda tecnologias como Python, Django, DRF, Docker, Golang, segurança em aplicações web e outros... Kauan também faz cursos online como os da udemy, alura, pycodebr, entre outros. Para mais informações, veja as informações sobre os certificados de Kauan.",
    "experiencia": "Kauan possui experiência com deploy de aplicações usando Docker, Nginx, uWSGI, Celery, Redis, entre outros."
}
